---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExtrusionAnalyzer
source: html/a4605c6d-ef2b-0296-4cd4-4c90704f9535.htm
---
# ExtrusionAnalyzer Properties

The end parameter (distance along the extrusion direction from the input plane) calculated by the extrusion analysis.